In [5]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%env DATABASE_URL=postgresql://sms_user:sms_password@localhost:5432/sms_db

env: DATABASE_URL=postgresql://sms_user:sms_password@localhost:5432/sms_db

In [7]:
%sql TRUNCATE TABLE users

 * postgresql://sms_user:***@localhost:5432/sms_db
Done.

[]

In [8]:
%%sql

INSERT INTO users(user_first_name,user_last_name,user_email_id)
VALUES ('Scott', 'Tiger', 'scott@tiger.com')

 * postgresql://sms_user:***@localhost:5432/sms_db
1 rows affected.

[]

In [9]:
%sql SELECT * FROM users

 * postgresql://sms_user:***@localhost:5432/sms_db
1 rows affected.

[(1, 'Scott', 'Tiger', 'scott@tiger.com', False, None, 'U', False, datetime.datetime(2021, 12, 8, 1, 5, 44, 352125), datetime.datetime(2021, 12, 8, 1, 5, 44, 352125))]

In [10]:
%%sql

INSERT INTO users(user_first_name,user_last_name,user_email_id)
VALUES ('Donald', 'Duck', 'donald@duck.com')

 * postgresql://sms_user:***@localhost:5432/sms_db
1 rows affected.

[]

In [11]:
%sql SELECT * FROM users

 * postgresql://sms_user:***@localhost:5432/sms_db
2 rows affected.

[(1, 'Scott', 'Tiger', 'scott@tiger.com', False, None, 'U', False, datetime.datetime(2021, 12, 8, 1, 5, 44, 352125), datetime.datetime(2021, 12, 8, 1, 5, 44, 352125)),
 (2, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', False, datetime.datetime(2021, 12, 8, 1, 7, 32, 519242), datetime.datetime(2021, 12, 8, 1, 7, 32, 519242))]

In [12]:
%%sql

INSERT INTO users(user_first_name,user_last_name,user_email_id)
VALUES ('Mickey', 'Mouse', 'mickey@mouse.com')

 * postgresql://sms_user:***@localhost:5432/sms_db
1 rows affected.

[]

In [13]:
%sql SELECT * FROM users

 * postgresql://sms_user:***@localhost:5432/sms_db
3 rows affected.

[(1, 'Scott', 'Tiger', 'scott@tiger.com', False, None, 'U', False, datetime.datetime(2021, 12, 8, 1, 5, 44, 352125), datetime.datetime(2021, 12, 8, 1, 5, 44, 352125)),
 (2, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', False, datetime.datetime(2021, 12, 8, 1, 7, 32, 519242), datetime.datetime(2021, 12, 8, 1, 7, 32, 519242)),
 (3, 'Mickey', 'Mouse', 'mickey@mouse.com', False, None, 'U', False, datetime.datetime(2021, 12, 8, 1, 8, 26, 206646), datetime.datetime(2021, 12, 8, 1, 8, 26, 206646))]

In [14]:
%%sql

INSERT INTO users 
    (user_first_name, user_last_name, user_email_id, user_password, user_role, is_active) 
VALUES 
    ('Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', 'h9LAz7p7ub', 'U', true),
    ('Tobe', 'Lyness', 'tlyness1@paginegialle.it', 'oEofndp', 'U', true),
    ('Addie', 'Mesias', 'amesias2@twitpic.com', 'ih7Y69u56', 'U', true)

 * postgresql://sms_user:***@localhost:5432/sms_db
3 rows affected.

[]